{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v3.3.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 18, 21], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "h0"}, "name": "h0", "inbound_nodes": []}, {"class_name": "Bidirectional", "config": {"name": "bidirectional", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 32, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}, "name": "bidirectional", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "RepeatVector", "config": {"name": "repeat_vector", "trainable": true, "dtype": "float32", "n": 18}, "name": "repeat_vector", "inbound_nodes": [[["h0", 0, 0, {}]], [["lstm", 0, 0, {}]], [["lstm", 1, 0, {}]], [["lstm", 2, 0, {}]], [["lstm", 3, 0, {}]], [["lstm", 4, 0, {}]], [["lstm", 5, 0, {}]], [["lstm", 6, 0, {}]], [["lstm", 7, 0, {}]], [["lstm", 8, 0, {}]], [["lstm", 9, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["bidirectional", 0, 0, {}], ["repeat_vector", 0, 0, {}]], [["bidirectional", 0, 0, {}], ["repeat_vector", 1, 0, {}]], [["bidirectional", 0, 0, {}], ["repeat_vector", 2, 0, {}]], [["bidirectional", 0, 0, {}], ["repeat_vector", 3, 0, {}]], [["bidirectional", 0, 0, {}], ["repeat_vector", 4, 0, {}]], [["bidirectional", 0, 0, {}], ["repeat_vector", 5, 0, {}]], [["bidirectional", 0, 0, {}], ["repeat_vector", 6, 0, {}]], [["bidirectional", 0, 0, {}], ["repeat_vector", 7, 0, {}]], [["bidirectional", 0, 0, {}], ["repeat_vector", 8, 0, {}]], [["bidirectional", 0, 0, {}], ["repeat_vector", 9, 0, {}]], [["bidirectional", 0, 0, {}], ["repeat_vector", 10, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 10, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["concatenate", 0, 0, {}]], [["concatenate", 1, 0, {}]], [["concatenate", 2, 0, {}]], [["concatenate", 3, 0, {}]], [["concatenate", 4, 0, {}]], [["concatenate", 5, 0, {}]], [["concatenate", 6, 0, {}]], [["concatenate", 7, 0, {}]], [["concatenate", 8, 0, {}]], [["concatenate", 9, 0, {}]], [["concatenate", 10, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["dense", 0, 0, {}]], [["dense", 1, 0, {}]], [["dense", 2, 0, {}]], [["dense", 3, 0, {}]], [["dense", 4, 0, {}]], [["dense", 5, 0, {}]], [["dense", 6, 0, {}]], [["dense", 7, 0, {}]], [["dense", 8, 0, {}]], [["dense", 9, 0, {}]], [["dense", 10, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "attention_weights", "trainable": true, "dtype": "float32", "activation": "softmax"}, "name": "attention_weights", "inbound_nodes": [[["dense_1", 0, 0, {}]], [["dense_1", 1, 0, {}]], [["dense_1", 2, 0, {}]], [["dense_1", 3, 0, {}]], [["dense_1", 4, 0, {}]], [["dense_1", 5, 0, {}]], [["dense_1", 6, 0, {}]], [["dense_1", 7, 0, {}]], [["dense_1", 8, 0, {}]], [["dense_1", 9, 0, {}]], [["dense_1", 10, 0, {}]]]}, {"class_name": "Dot", "config": {"name": "dot", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "name": "dot", "inbound_nodes": [[["attention_weights", 0, 0, {}], ["bidirectional", 0, 0, {}]], [["attention_weights", 1, 0, {}], ["bidirectional", 0, 0, {}]], [["attention_weights", 2, 0, {}], ["bidirectional", 0, 0, {}]], [["attention_weights", 3, 0, {}], ["bidirectional", 0, 0, {}]], [["attention_weights", 4, 0, {}], ["bidirectional", 0, 0, {}]], [["attention_weights", 5, 0, {}], ["bidirectional", 0, 0, {}]], [["attention_weights", 6, 0, {}], ["bidirectional", 0, 0, {}]], [["attention_weights", 7, 0, {}], ["bidirectional", 0, 0, {}]], [["attention_weights", 8, 0, {}], ["bidirectional", 0, 0, {}]], [["attention_weights", 9, 0, {}], ["bidirectional", 0, 0, {}]], [["attention_weights", 10, 0, {}], ["bidirectional", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "ragged": false, "name": "c0"}, "name": "c0", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"name": "lstm", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": true, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 64, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}, "name": "lstm", "inbound_nodes": [[["dot", 0, 0, {}], ["h0", 0, 0, {}], ["c0", 0, 0, {}]], [["dot", 1, 0, {}], ["lstm", 0, 0, {}], ["lstm", 0, 2, {}]], [["dot", 2, 0, {}], ["lstm", 1, 0, {}], ["lstm", 1, 2, {}]], [["dot", 3, 0, {}], ["lstm", 2, 0, {}], ["lstm", 2, 2, {}]], [["dot", 4, 0, {}], ["lstm", 3, 0, {}], ["lstm", 3, 2, {}]], [["dot", 5, 0, {}], ["lstm", 4, 0, {}], ["lstm", 4, 2, {}]], [["dot", 6, 0, {}], ["lstm", 5, 0, {}], ["lstm", 5, 2, {}]], [["dot", 7, 0, {}], ["lstm", 6, 0, {}], ["lstm", 6, 2, {}]], [["dot", 8, 0, {}], ["lstm", 7, 0, {}], ["lstm", 7, 2, {}]], [["dot", 9, 0, {}], ["lstm", 8, 0, {}], ["lstm", 8, 2, {}]], [["dot", 10, 0, {}], ["lstm", 9, 0, {}], ["lstm", 9, 2, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 21, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["lstm", 0, 0, {}]], [["lstm", 1, 0, {}]], [["lstm", 2, 0, {}]], [["lstm", 3, 0, {}]], [["lstm", 4, 0, {}]], [["lstm", 5, 0, {}]], [["lstm", 6, 0, {}]], [["lstm", 7, 0, {}]], [["lstm", 8, 0, {}]], [["lstm", 9, 0, {}]], [["lstm", 10, 0, {}]]]}], "input_layers": [["input_1", 0, 0], ["h0", 0, 0], ["c0", 0, 0]], "output_layers": [["dense_2", 0, 0], ["dense_2", 1, 0], ["dense_2", 2, 0], ["dense_2", 3, 0], ["dense_2", 4, 0], ["dense_2", 5, 0], ["dense_2", 6, 0], ["dense_2", 7, 0], ["dense_2", 8, 0], ["dense_2", 9, 0], ["dense_2", 10, 0]]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": ["accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.04927290976047516, "decay": 0.009999999776482582, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional/forward_lstm_1/kernel", "shape": [21, 128], "dtype": "float32"}, {"name": "bidirectional/forward_lstm_1/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional/forward_lstm_1/bias", "shape": [128], "dtype": "float32"}, {"name": "bidirectional/backward_lstm_1/kernel", "shape": [21, 128], "dtype": "float32"}, {"name": "bidirectional/backward_lstm_1/recurrent_kernel", "shape": [32, 128], "dtype": "float32"}, {"name": "bidirectional/backward_lstm_1/bias", "shape": [128], "dtype": "float32"}, {"name": "dense/kernel", "shape": [128, 10], "dtype": "float32"}, {"name": "dense/bias", "shape": [10], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [10, 1], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [1], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [64, 21], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [21], "dtype": "float32"}, {"name": "lstm/kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "lstm/recurrent_kernel", "shape": [64, 256], "dtype": "float32"}, {"name": "lstm/bias", "shape": [256], "dtype": "float32"}]}]}